Ran Plan for 2 projects:

1. dir: `base` workspace: `staging`
1. dir: `base` workspace: `production`

### 1. dir: `base` workspace: `staging`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
- destroy

Terraform will perform the following actions:

  # aws_vpc.example2 will be destroyed
- resource "aws_vpc" "example2" {
      - arn                              = "arn:aws:ec2:us-east-1:027056559285:vpc/vpc-0058a19b969c4ad5a" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.0.0.0/16" -> null
      - default_network_acl_id           = "acl-085a651763a4556c4" -> null
      - default_route_table_id           = "rtb-04963a0212afcf27f" -> null
      - default_security_group_id        = "sg-0f319757fdd1f4e8c" -> null
      - dhcp_options_id                  = "dopt-afa69ed4" -> null
      - enable_classiclink               = false -> null
      - enable_classiclink_dns_support   = false -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-0058a19b969c4ad5a" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-04963a0212afcf27f" -> null
      - owner_id                         = "027056559285" -> null
      - tags                             = {
          - "Name" = "tenant1-base-staging"
        } -> null
    }

  # aws_vpc.example4 will be created
+ resource "aws_vpc" "example4" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "tenant1-base-staging"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d base -w staging`
* :put_litter_in_its_place: To **delete** this plan click [here](http://54.236.73.108/lock?id=peterdyer7%252Fatlantistest%252Fbase%252Fstaging)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d base -w staging`
</details>

---
### 2. dir: `base` workspace: `production`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/bin/terraform plan -input=false -refresh -no-color -out \"/root/.atlantis/repos/peterdyer7/atlantistest/27/production/base/production.tfplan\"" in "/root/.atlantis/repos/peterdyer7/atlantistest/27/production/base": exit status 1

Error: Error locking state: Error acquiring the state lock: ConditionalCheckFailedException: The conditional request failed
	status code: 400, request id: O2VG4JCFBHLDO7ENI3U19CTLQBVV4KQNSO5AEMVJF66Q9ASUAAJG
Lock Info:
  ID:        f47d3dc8-07ba-f41d-517a-e87081335070
  Path:      terraform-backend-peter/env:/production/tenant1/base/terraform.tfstate
  Operation: OperationTypePlan
  Who:       ec2-user@ip-172-31-94-219.ec2.internal
  Version:   0.12.12
  Created:   2019-10-21 23:34:28.979302173 +0000 UTC
  Info:      


Terraform acquires a state lock to protect the state from being written
by multiple users at the same time. Please resolve the issue above and try
again. For most commands, you can disable locking with the "-lock=false"
flag, but this is not recommended.



```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
